Revit 2027 API
CircuitType Enumeration
 An enumerated type listing all the possible circuit types.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CircuitType
Public Enumeration CircuitType
public enum class CircuitType
type CircuitType
Members
Member name | Value | Description
Circuit | 0 |  Circuit type is circuit.
Space | 2 |  Circuit type is space.
Spare | 1 |  Circuit type is spare.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace